Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The patch is not appropriate for upstream, include a brief reason on the same line enclosed with ``[]``. In the past, there were several different reasons not to submit patches upstream, but we have to consider that every non-upstreamed patch means a maintenance burden for recipe maintainers. Currently, the only reasons to mark patches as inappropriate for upstream submission are:
it_it: La patch non è appropriata per l'invio al progetto upstream. Si prega di includere una breve motivazione sulla stessa riga, racchiusa tra parentesi quadre ``[]``. In passato, esistevano diverse ragioni per non inviare patch al progetto upstream, ma dobbiamo considerare che ogni patch non inviata al progetto upstream rappresenta un onere di manutenzione per i manutentori delle ricette. Attualmente, le uniche ragioni per contrassegnare una patch come non appropriata per l'invio al progetto upstream sono:

source: The paths in this list must be *absolute* paths from the point of view of the root filesystem on the target, and must *not* make a reference to the variable :term:`D` or any :term:`WORKDIR` related variable. A correct example would be::
it_it: I path in questo elenco devono essere percorsi *assoluti* dal punto di vista del filesystem root sul target e *non* devono fare riferimento alla variabile :term:`D` o a qualsiasi variabile correlata a :term:`WORKDIR`. Un esempio corretto sarebbe::

source: The pcdeps mechanism most often infers dependencies between -dev packages.
it_it: Il meccanismo pcdeps deduce più spesso le dipendenze tra pacchetti con l'opzione -dev.

source: The perf tool is pretty much self-documenting. To remind yourself of the available commands, just type ``perf``, which will show you basic usage along with the available perf subcommands::
it_it: Il tool perf è praticamente autoesplicativo. Per ricordare i comandi disponibili, basta digitare ``perf``, che mostrerà l'utilizzo di base insieme ai sottocomandi disponibili::

source: The perf tool is the profiling and tracing tool that comes bundled with the Linux kernel.
it_it: Lo tool perf è lo strumento di profilazione e tracing [tracciamento] incluso nel kernel Linux.

source: The point release indicates a point in the major release branch where a full QA cycle and release process validates the content of the new branch.
it_it: Il punto della release indica un punto nel ramo della versione principale in cui un ciclo completo di controllo qualità e processo di rilascio convalida il contenuto del nuovo ramo [branch].

source: The pre-set data for Toaster is easily customizable. You can create the ``orm/fixtures/custom.xml`` file to customize the values that go into the database. Customization is additive, and can either extend or completely replace the existing values.
it_it: I dati preimpostati per Toaster sono facilmente personalizzabili. È possibile creare il file ``orm/fixtures/custom.xml`` per personalizzare i valori inseriti nel database. La personalizzazione è additiva e può estendere o sostituire completamente i valori esistenti.

source: The previous command installs the necessary Toaster modules into a local Python 3 cache in your ``$HOME`` directory. The caches is actually located in ``$HOME/.local``. To see what packages have been installed into your ``$HOME`` directory, do the following::
it_it: Il comando precedente installa i moduli Toaster necessari in una cache locale di Python 3 nella directory ``$HOME``. La cache si trova effettivamente in ``$HOME/.local``. Per vedere quali pacchetti sono stati installati nella directory ``$HOME``, eseguire il seguente comando::

source: The previous example does not include :term:`WORKDIR` since that variable is actually constructed as a path within :term:`TMPDIR`, which is included above.
it_it: L'esempio precedente non include :term:`WORKDIR` poiché tale variabile è effettivamente costruita come un path all'interno di :term:`TMPDIR`, che è inclusa nell'esempio precedente.

source: The previous section described the user configurations that define BitBake's global behavior. This section takes a closer look at the layers the build system uses to further control the build. These layers provide Metadata for the software, machine, and policies.
it_it: La sezione precedente ha descritto le configurazioni utente che definiscono il comportamento globale di BitBake. Questa sezione esamina più da vicino i layer utilizzati dal sistema di build per controllare ulteriormente il processo di build. Questi layer forniscono metadati per il software, la macchina e le policy.

source: The previous steps are for demonstration purposes only. If you were to attempt to build an image for the ``raspberrypi5`` machine, you should read the ``README.md`` file in ``meta-raspberrypi``.
it_it: I passaggi precedenti sono solo a scopo dimostrativo. Per tentare di creare un'immagine per la macchina ``raspberrypi5``, si deve leggere il file ``README.md`` in ``meta-raspberrypi``.

source: The problem (and solution) was discovered by using the Yocto tracing tools, in this case 'perf stat', 'perf script', 'perf record' and 'perf report'.
it_it: Il problema (e la soluzione) sono stati scoperti utilizzando i tool di tracing di Yocto, in questo caso 'perf stat', 'perf script', 'perf record' e 'perf report'.

source: The problem is that perf can't find the symbol information for the ``busybox`` binary, which is actually stripped out by the Yocto build system.
it_it: Il problema è che perf non riesce a trovare le informazioni sui simboli per il binario ``busybox``, che vengono rimosse dal sistema di build Yocto.

source: The process for proposing changes to a Yocto Project stable branch differs from the steps described above. Changes to a stable branch must address identified bugs or CVEs and should be made carefully in order to avoid the risk of introducing new bugs or breaking backwards compatibility. Typically bug fixes must already be accepted into the master branch before they can be backported to a stable branch unless the bug in question does not affect the master branch or the fix on the master branch is unsuitable for backporting.
it_it: La procedura per proporre modifiche a un branch stabile di Yocto Project differisce dai passaggi descritti sopra. Le modifiche a un branch stabile devono risolvere bug o CVE identificati e devono essere apportate con attenzione per evitare il rischio di introdurre nuovi bug o compromettere la compatibilità con le versioni precedenti. In genere, le correzioni di bug devono essere già state accettate nel branch master prima di poter essere retroportate a un branch stabile, a meno che il bug in questione non influisca sul branch master o la correzione sul branch master non sia adatta al "backporting" [retroportazione].

source: The process is identical to the process used for the ``meta-intel`` layer except for the layer's name. For example, if you determine that your hardware most closely matches the ``meta-raspberrypi``, clone that layer::
it_it: La procedura è identica a quella utilizzata per il layer ``meta-intel`` ad eccezione del nome del layer. Ad esempio, se si determina che l'hardware è più simile al layer ``meta-raspberrypi``, clonare quel layer::

source: The projects are acutely aware that potential new contributors find the mailing list approach off-putting and would prefer a web-based GUI. Since we don't believe that can work for us, the project is aiming to ensure `patchwork <https://patchwork.yoctoproject.org/>`__ is available to help track patch status and also looking at how tooling can provide more feedback to users about patch status. We are looking at improving tools such as ``patchtest`` to test user contributions before they hit the mailing lists and also at better documenting how to use such workflows since we recognise that whilst this was common knowledge a decade ago, it might not be as familiar now.
it_it: I progetti sono perfettamente consapevoli che i potenziali nuovi collaboratori trovano l'approccio tramite mailing list scoraggiante e preferirebbero un'interfaccia grafica basata sul web. Poiché non crediamo che questa soluzione possa funzionare per noi, il progetto si propone di rendere disponibile `patchwork <https://patchwork.yoctoproject.org/>`__ per aiutare a monitorare lo stato delle patch e sta anche valutando come gli strumenti possano fornire un feedback più completo agli utenti sullo stato delle patch. Stiamo cercando di migliorare strumenti come ``patchtest`` per testare i contributi degli utenti prima che vengano inviati alle mailing list e anche di documentare meglio come utilizzare tali flussi di lavoro, poiché riconosciamo che, mentre questo era di dominio pubblico dieci anni fa, potrebbe non esserlo più.

source: The proposed form described in this section does have elements that are specific to the OpenEmbedded build system. It is intended that developers can use this structure with other build systems besides the OpenEmbedded build system. It is also intended that it will be simple to extract information and convert it to other formats if required. The OpenEmbedded build system, through its standard :ref:`layers mechanism <overview-manual/yp-intro:the yocto project layer model>`, can directly accept the format described as a layer. The BSP layer captures all the hardware-specific details in one place using a standard format, which is useful for any person wishing to use the hardware platform regardless of the build system they are using.
it_it: La struttura proposta descritta in questa sezione presenta elementi specifici del sistema di build OpenEmbedded. L'obiettivo è che gli sviluppatori possano utilizzare questa struttura con altri sistemi di build oltre a OpenEmbedded. È inoltre previsto che sia semplice estrarre informazioni e convertirle in altri formati, se necessario. Il sistema di build OpenEmbedded, tramite il suo meccanismo standard di :ref:`layer mechanism <overview-manual/yp-intro:the yocto project layer model>`, può accettare direttamente il formato descritto come layer. Il layer BSP raccoglie tutti i dettagli specifici dell'hardware in un unico punto utilizzando un formato standard, utile per chiunque desideri utilizzare la piattaforma hardware, indipendentemente dal sistema di build utilizzato.

source: The purpose of this manual is to present a set of common and generally useful tracing and profiling idioms along with their application (as appropriate) to each tool, in the context of a general-purpose 'drill-down' methodology that can be applied to solving a large number of problems. For help with more advanced usages and problems, refer to the documentation and/or websites provided for each tool.
it_it: Lo scopo di questo manuale è presentare una serie di idiomi di tracing e profilazione comuni e generalmente utili, insieme alla loro applicazione (ove appropriato) a ciascun tool, nel contesto di una metodologia di analisi approfondita di carattere generale, applicabile alla risoluzione di un'ampia gamma di problemi. Per assistenza su utilizzi e problematiche più avanzate, fare riferimento alla documentazione e/o ai siti web forniti per ciascun tool.

source: The quickest and easiest way to get some basic overall data about what's going on for a particular workload is to profile it using ``perf stat``. This command basically profiles using a few default counters and displays the summed counts at the end of the run::
it_it: Il modo più rapido e semplice per ottenere dati generali di base su cosa sta succedendo per un particolare carico di lavoro è profilarlo usando ``perf stat``. Questo comando esegue un'analisi delle prestazioni utilizzando alcuni contatori predefiniti e visualizza la somma dei valori al termine dell'esecuzione::

source: The recipe has both generic and security-related fixes. The CVE patch files are named according to the CVE they fix.
it_it: La ricetta include sia correzioni generiche che specifiche per la sicurezza. I file di patch CVE prendono il nome dalla vulnerabilità CVE che correggono.

source: The recipe work directory --- ``${WORKDIR}``.
it_it: La directory di lavoro della ricetta --- ``${WORKDIR}``.

source: The recommended method for setting up the Yocto Project is to use :ref:`overview-manual/development-environment:git` to create a local copy of the upstream repositories.
it_it: Il metodo consigliato per configurare Yocto Project è utilizzare :ref:`overview-manual/development-environment:git` per creare una copia locale dei repository upstream.

source: The remainder of the layer is dedicated to specific recipes by function: ``recipes-bsp``, ``recipes-core``, ``recipes-graphics``, ``recipes-kernel``, and so forth. There can be metadata for multiple formfactors, graphics support systems, and so forth.
it_it: La parte restante del layer è dedicata a ricette specifiche per funzione: ``recipes-bsp``, ``recipes-core``, ``recipes-graphics``, ``recipes-kernel`` e così via. Possono essere presenti metadati per più fattori di forma, sistemi di supporto grafico e altro ancora.

source: The remainder of this section overviews advantages and challenges tied to the Yocto Project.
it_it: Il resto di questa sezione illustra i vantaggi e le sfide legate a Yocto Project.

source: The remainder of this section provides a deeper look into the source files and the mirrors. Here is a more detailed look at the source file area of the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>`:
it_it: Il resto di questa sezione fornisce un'analisi più approfondita dei file sorgente e dei mirror. Ecco una descrizione più dettagliata dell'area dei file sorgente nella :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`:

source: The remainder of this section provides a description of the Yocto Project reference BSP for Beaglebone, which resides in the :yocto_git:`meta-yocto-bsp </meta-yocto/tree/meta-yocto-bsp>` layer.
it_it: La parte restante di questa sezione fornisce una descrizione del BSP di riferimento di Yocto Project per Beaglebone, che risiede nel layer :yocto_git:`meta-yocto-bsp </meta-yocto/tree/meta-yocto-bsp>`.

source: The report shows each event that was found in the blktrace data, along with a summary of the overall block I/O traffic during the run. You can look at the :manpage:`blkparse(1)` manual page to learn the meaning of each field displayed in the trace listing.
it_it: Il report mostra ogni evento rilevato nei dati di blktrace, insieme a un riepilogo del traffico I/O a blocchi complessivo durante l'esecuzione. È possibile consultare la pagina del manuale :manpage:`blkparse(1)` per conoscere il significato di ciascun campo visualizzato nell'elenco delle tracce.

source: The requirements for a released BSP that conform to the Yocto Project are:
it_it: I requisiti per un BSP rilasciato conforme a Yocto Project sono:

source: The requirements for the BSP as it is made available to a developer are completely independent of the released form of the BSP. For example, the BSP Metadata can be contained within a Git repository and could have a directory structure completely different from what appears in the officially released BSP layer.
it_it: I requisiti per il BSP, così come viene reso disponibile a uno sviluppatore, sono completamente indipendenti dalla versione rilasciata del BSP. Ad esempio, i metadati del BSP possono essere contenuti in un repository Git e potrebbero avere una struttura di directory completamente diversa da quella presente nel layer BSP rilasciato ufficialmente.

source: The requirements here assume the BSP layer is a well-formed, "legal" layer that can be added to the Yocto Project. For guidelines on creating a layer that meets these base requirements, see the ":ref:`bsp-manual/bsp:bsp layers`" section in this manual and the ":ref:`dev-manual/layers:understanding and creating layers`" section in the Yocto Project Development Tasks Manual.
it_it: I requisiti qui descritti presuppongono che il layer BSP sia un layer "valido" e ben formato, che può essere aggiunto a Yocto Project. Per le linee guida sulla creazione di un layer che soddisfi questi requisiti di base, consultare la sezione ":ref:`bsp-manual/bsp:bsp layers`" in questo manuale e la sezione ":ref:`dev-manual/layers:understanding and creating layers`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: The requirements in this section apply regardless of how you package a BSP. You should consult the packaging and distribution guidelines for your specific release process. For an example of packaging and distribution requirements, see the ":yocto_wiki:`Third Party BSP Release Process </Third_Party_BSP_Release_Process>`" wiki page.
it_it: I requisiti in questa sezione si applicano indipendentemente da come viene impacchettato un BSP. È necessario consultare le linee guida di impacchettamento e distribuzione per il proprio specifico processo di rilascio. Per un esempio di requisiti di packaging e distribuzione, consultare la pagina wiki ":yocto_wiki:`Third Party BSP Release Process </Third_Party_BSP_Release_Process>`".

source: The rest of this section goes into detail about the overall incremental build architecture, the checksums (signatures), and shared state.
it_it: Il resto di questa sezione descrive in dettaglio l'architettura generale delle build incrementali, i checksum (firme) e lo shared state.

source: The rules for deciding which hashes of dependent tasks to include through dependency chains are more complex and are generally accomplished with a Python function. The code in ``meta/lib/oe/sstatesig.py`` shows two examples of this and also illustrates how you can insert your own policy into the system if so desired. This file defines the two basic signature generators :term:`OpenEmbedded-Core (OE-Core)` uses: "OEBasic" and "OEBasicHash". By default, a dummy "noop" signature handler is enabled in BitBake. This means that behavior is unchanged from previous versions. OE-Core uses the "OEBasicHash" signature handler by default through this setting in the ``bitbake.conf`` file::
it_it: Le regole per decidere quali hash di task dipendenti includere nelle catene di dipendenza sono più complesse e vengono generalmente implementate tramite una funzione Python. Il codice in ``meta/lib/oe/sstatesig.py`` mostra due esempi di questo e illustra anche come è possibile inserire una propria policy nel sistema, se lo si desidera. Questo file definisce i due generatori di firme di base utilizzati da :term:`OpenEmbedded-Core (OE-Core)`: "OEBasic" e "OEBasicHash". Per default, in BitBake è abilitato un gestore di firme fittizio "noop". Ciò significa che il comportamento è invariato rispetto alle versioni precedenti. OE-Core utilizza per impostazione predefinita il gestore di firme "OEBasicHash" tramite questa impostazione nel file ``bitbake.conf``::

source: The screenshot above shows the results of running a profile using sched:sched_switch tracepoint, which shows the relative costs of various paths to ``sched_wakeup`` (note that ``sched_wakeup`` is the name of the tracepoint --- it's actually defined just inside ``ttwu_do_wakeup()``, which accounts for the function name actually displayed in the profile:
it_it: Lo screenshot qui sopra mostra i risultati dell'esecuzione di un profilo utilizzando il tracepoint sched:sched_switch, che mostra i costi relativi dei vari percorsi verso ``sched_wakeup`` (si noti che ``sched_wakeup`` è il nome del tracepoint: è effettivamente definito all'interno di ``ttwu_do_wakeup()``, il che spiega il nome della funzione effettivamente visualizzato nel profilo):

source: The script uses the output from the :ref:`ref-classes-vex` as input, together with CVE information from the Linux kernel CNA to enrich the report file with updated CVE information.
it_it: Lo script utilizza l'output di :ref:`ref-classes-vex` come input, insieme alle informazioni CVE del kernel Linux CNA, per arricchire il file di report con informazioni CVE aggiornate.

source: The security policy of the upstream project might include a notification to Linux distributions or other important downstream projects in advance to discuss coordinated disclosure. These mailing lists are normally non-public.
it_it: La politica di sicurezza del progetto upstream potrebbe includere una notifica preventiva alle distribuzioni Linux o ad altri importanti progetti downstream per discutere una divulgazione coordinata. Queste mailing list sono normalmente private.

source: The shared state code uses a checksum, which is a unique signature of a task's inputs, to determine if a task needs to be run again. Because it is a change in a task's inputs that triggers a rerun, the process needs to detect all the inputs to a given task. For shell tasks, this turns out to be fairly easy because the build process generates a "run" shell script for each task and it is possible to create a checksum that gives you a good idea of when the task's data changes.
it_it: Il codice di "shared state" [stato condiviso] utilizza un checksum, ovvero una firma univoca degli input di un task, per determinare se un task deve essere eseguito nuovamente. Poiché è una modifica negli input di un task a innescarne la riesecuzione, il processo deve rilevare tutti gli input di un dato task. Per i task di shell, questo risulta piuttosto semplice perché il processo di build genera uno script di shell "run" per ogni task ed è possibile creare un checksum che fornisce una buona indicazione di quando i dati del task cambiano.

source: The shared state directory (:term:`SSTATE_DIR`) is organized into two-character subdirectories, where the subdirectory names are based on the first two characters of the hash. If the shared state directory structure for a mirror has the same structure as :term:`SSTATE_DIR`, you must specify "PATH" as part of the URI to enable the build system to map to the appropriate subdirectory.
it_it: La directory dello stato condiviso [shared state] (:term:`SSTATE_DIR`) è organizzata in sottodirectory di due caratteri, i cui nomi si basano sui primi due caratteri dell'hash. Se la struttura della directory di stato condiviso per un mirror ha la stessa struttura di :term:`SSTATE_DIR`, è necessario specificare "PATH" come parte dell'URI per consentire al sistema di compilazione di mappare la sottodirectory appropriata.

source: The shared state package validity can be detected just by looking at the filename since the filename contains the task checksum (or signature) as described earlier in this section. If a valid shared state package is found, the build process downloads it and uses it to accelerate the task.
it_it: La validità del pacchetto di stato condiviso può essere rilevata semplicemente esaminando il nome del file, poiché quest'ultimo contiene il checksum (o la firma) del task, come descritto in precedenza in questa sezione. Se viene trovato un pacchetto di stato condiviso valido, il processo di compilazione lo scarica e lo utilizza per accelerare il task.

source: The shared state was successfully verified and used!
it_it: Lo shared state è stato verificato e utilizzato correttamente!

source: The skeleton script just creates a Python function for each event type in the ``perf.data`` file. The body of each function just prints the event name along with its parameters. For example:
it_it: Lo script di base crea semplicemente una funzione Python per ogni tipo di evento presente nel file ``perf.data``. Il corpo di ogni funzione si limita a stampare il nome dell'evento insieme ai suoi parametri. Ad esempio:
